[
  {
    "id": "navigate-charts",
    "title": "Viewing visualizations",
    "sortOrder": 1,
    "demoGif": "/02-manual-screenshots/04-navigate-charts-and-show-info.gif",
    "demoAlt": "Navigating through charts and showing info demo",
    "platforms": {
      "ios": true,
      "android": true,
      "web": true
    },
    "dateReleased": "2025-12-27",
    "version": "1.0.0",
    "sections": {
      "howToUse": "Browse the main screen to see all available charts for your selected sport. Tap any chart to view the full interactive version. On the chart screen, tap the info icon (ℹ) in the top-right corner to see a description of what the chart displays.",
      "whatItDoes": "Fastbreak's core functionality is viewing different types of statistical visualizations. Each chart includes an info button that provides context about the metrics being displayed, helping you understand what the data represents and how to interpret it.",
      "whyUseful": "With dozens of different charts covering all aspects of each sport, fastbreak helps you quickly find the exact data you're looking for. The info descriptions ensure you understand each metric, making it easier to discover insights and compare stats meaningfully."
    }
  },
  {
    "id": "pinch-zoom",
    "title": "Pinch to Zoom, Drag to pan",
    "sortOrder": 2,
    "demoGif": "/02-manual-screenshots/01-pinch-to-zoom.gif",
    "demoAlt": "Pinch to zoom and drag to pan demo",
    "platforms": {
      "ios": true,
      "android": true,
      "web": false
    },
    "dateReleased": "2025-12-27",
    "version": "1.0.0",
    "sections": {
      "howToUse": "Use two fingers to pinch in or out on any chart to zoom. Once zoomed, drag with one finger to pan around and explore different areas of the visualization.",
      "whatItDoes": "Provides intuitive touch gestures for exploring detailed charts on mobile devices. Pinch gestures control zoom level, while drag gestures allow you to navigate around the zoomed view.",
      "whyUseful": "When charts contain lots of data points or detailed information, zooming and panning lets you focus on specific areas of interest without losing context. This is especially useful for time-series data or crowded visualizations."
    }
  },
  {
    "id": "pin-teams",
    "title": "Pinning teams",
    "sortOrder": 3,
    "demoGif": "/02-manual-screenshots/02-manage-teams-and-filter.gif",
    "demoAlt": "Managing teams and filtering demo",
    "platforms": {
      "ios": true,
      "android": true,
      "web": false
    },
    "dateReleased": "2025-12-27",
    "version": "1.1.0",
    "sections": {
      "howToUse": "Select the menu icon and select Settings. Tap the Manage Teams button and select the filter icon to open the team selector. Select your favorite teams to pin them. Pinned teams created a badge in each chart to easily highlight each pinned team for that chart.",
      "whatItDoes": "Allows you to select and highlight specific teams within each chart. Your pinned teams are saved and persist across sessions, so you don't need to select them every time.",
      "whyUseful": "If you follow specific teams, pinning them makes it much easier to find and highlight their stats within a chart. Easy selection and highlighting helps you quickly identify your teams' performance in any visualization."
    }
  },
  {
    "id": "highlight-data-points",
    "title": "Highlighting data points",
    "sortOrder": 4,
    "demoGif": "/02-manual-screenshots/03-highlighting-data-points.gif",
    "demoAlt": "Highlighting data points demo",
    "platforms": {
      "ios": true,
      "android": true,
      "web": false
    },
    "dateReleased": "2025-12-27",
    "version": "1.2.0",
    "sections": {
      "howToUse": "Tap on any data point in the list below the chart to highlight it on the chart. The selected point will be emphasized while other points fade slightly, making it easier to focus on specific values.",
      "whatItDoes": "Provides an interactive way to explore individual data points in charts. When you tap a point, a tooltip or detail view appears showing the exact values, team name, and any relevant contextual information.",
      "whyUseful": "Charts often contain many overlapping or closely-spaced data points. Highlighting lets you precisely examine individual values without confusion, and the detailed view provides context that might not fit in the main chart."
    }
  },
  {
    "id": "offline-support",
    "title": "Offline support",
    "sortOrder": 5,
    "demoGif": "/02-manual-screenshots/05-refresh-button.gif",
    "demoAlt": "Refresh button demo showing offline support",
    "platforms": {
      "ios": true,
      "android": true,
      "web": false
    },
    "dateReleased": "2025-12-29",
    "version": "1.3.0",
    "sections": {
      "howToUse": "Tap the refresh button in the top-right corner of the header to update all charts with the latest data. Alternatively, open Settings from the side menu and tap 'Refresh Registry' to manually sync the chart data. Visual indicators will show when charts are being updated.",
      "whatItDoes": "Enables the mobile apps to work completely offline once charts are downloaded initially. When you refresh, the app downloads and caches all chart data locally on your device. The refresh button provides visual feedback during the update process, showing loading states and success indicators.",
      "whyUseful": "Once you've refreshed the data, you can view all charts without an internet connection, making fastbreak perfect for situations with poor connectivity or when you want to save mobile data. The visual indicators ensure you always know when you're viewing the most current data versus cached data, giving you confidence in the information you're seeing."
    }
  },
  {
    "id": "matchup-worksheet",
    "title": "Matchup Worksheets",
    "sortOrder": 6,
    "demoGif": "/02-manual-screenshots/06-matchup-worksheet.gif",
    "demoAlt": "Matchup Worksheet demo showing matchup selection and chart interaction",
    "platforms": {
      "ios": true,
      "android": true,
      "web": false
    },
    "dateReleased": "2026-01-03",
    "version": "1.4.0",
    "sections": {
      "howToUse": "Open the Matchup Worksheets from the NFL or NBA charts list. Scroll through the matchup badges at the top to browse different games, then tap a matchup to select it. View detailed team statistics in the Stats tab, or switch to the Charts tab to see visual comparisons. In the Charts tab, use the week range badges to filter the scatter plot by specific timeframes.",
      "whatItDoes": "Provides comprehensive head-to-head analysis for NFL and NBA matchups throughout the season. The worksheet combines team statistics, performance charts, and historical data in one interactive view. For the NFL, you can explore cumulative EPA trends, weekly offensive vs defensive performance, key player stats, head-to-head records, and common opponent comparisons for each matchup. For the NBA, you can explore offensive an defensive net rating over time and one month trends",
      "whyUseful": "The Matchup Worksheet consolidates all the information you need to analyze any week's games in one place. By combining stats and charts with interactive filtering, you can quickly compare teams across multiple dimensions and identify key factors that might determine the outcome. The ability to switch between matchups and timeframes makes it easy to analyze multiple games and spot trends throughout the season."
    }
  },
  {
    "id": "share-charts",
    "title": "Sharing Charts and Worksheets",
    "sortOrder": 7,
    "demoGif": "/02-manual-screenshots/07-share-matchup.gif",
    "demoAlt": "Share feature demo showing worksheet sharing with preview in native share dialog",
    "platforms": {
      "ios": true,
      "android": true,
      "web": false
    },
    "dateReleased": "2026-01-15",
    "version": "1.5.0",
    "sections": {
      "howToUse": "Look for the red share button (FAB) in the bottom-right corner on various charts and worksheets throughout the app. Tap the share button to capture the current view. The native share sheet will appear with a preview of the image. Select your preferred sharing method (text message, social media, email, etc.) to share the image with others. The demo shows sharing a matchup worksheet, but you'll find the share button on other visualizations as well.",
      "whatItDoes": "Generates a high-resolution image of the chart or worksheet you're viewing and opens your device's native share dialog with a preview. The shared image captures all the data currently displayed, including statistics, charts, and any applied filters. The image is automatically saved to your device and includes attribution to the data source.",
      "whyUseful": "Sharing your analysis is essential for discussing games with friends, posting insights on social media, or saving your own research for reference. The preview in the share dialog lets you confirm the image looks correct before sharing. The high-quality exported images capture all the important details in a shareable format, making it easy to communicate your findings without needing multiple screenshots or manual formatting."
    }
  },
  {
    "id": "topics",
    "title": "Daily Topics",
    "sortOrder": 8,
    "demoGif": "/02-manual-screenshots/08-topics-walkthrough.gif",
    "demoAlt": "Topics screen walkthrough showing data point navigation and mark as read",
    "platforms": {
      "ios": true,
      "android": true,
      "web": false
    },
    "dateReleased": "2026-02-20",
    "version": "1.6.0",
    "sections": {
      "howToUse": "Navigate to the Topics screen from the main menu. Scroll through the daily topics to see statistically grounded insights about your favorite sports. Each topic contains data points that link directly to relevant charts - tap any data point with an arrow to jump to that visualization. Use the '[mark as read]' button to track which topics you've reviewed.",
      "whatItDoes": [
        { "type": "text", "value": "Topics provides summaries and insights about what's happening across different sports. The content is generated everyday at 7am ET using " },
        { "type": "link", "value": "Google's Gemini with Grounded Search", "url": "https://docs.cloud.google.com/vertex-ai/generative-ai/docs/grounding/overview" },
        { "type": "text", "value": ", which ensures factual accuracy by verifying information against Google Search results. Each topic highlights key statistics and trends, with direct links to the underlying charts and visualizations. The system tracks which topics you've read, helping you stay on top of the latest developments." }
      ],
      "whyUseful": "Topics gives you a daily sports briefing without ads, clickbait, or fluff. Every insight is grounded in actual statistics from the app's charts and verified against Google Search results for factual accuracy. Instead of manually searching through dozens of charts, Topics surfaces the most interesting and relevant insights each day. The linked data points let you quickly dive deeper into any statistic that catches your attention, while the read tracking ensures you never miss important updates."
    }
  }
]
