{
  "nfl": [
    {
      "title": "NFL Offseason Quarterback Carousel and Schedule Expansion",
      "analysis": "The 2026 NFL offseason is shaping up to be one of the most unpredictable in recent memory, with nearly a third of the teams searching for new quarterbacks amid a weak draft class. This scarcity of top-tier quarterback talent will likely drive up the price for available free agents and trade targets. Teams like the Arizona Cardinals may look to move on from Kyler Murray, potentially via trade, to avoid a $19.5 million guarantee for his 2027 base salary. The Atlanta Falcons are expected to release Kirk Cousins. The Seattle Seahawks are coming off a Super Bowl LX victory against the New England Patriots 29-13. The NFL Combine opens February 23, and the NFL draft is set for late April in Pittsburgh. The legal tampering period begins March 8, and free agency officially begins March 11."
    },
    {
      "title": "Potential NFL Schedule Expansion and Cap Casualties",
      "analysis": "The NFL is considering expanding to an 18-game regular season starting in 2027, contingent on negotiations with the NFL Players Association. The date for Super Bowl LXII, which will cap the 2027 season, remains unannounced, with a February 20, 2028 date signaling the expanded schedule. Several players are in danger of becoming salary cap casualties. James Conner of the Arizona Cardinals could be released, saving the team around $7.6 million in cap space. D\u0027Andre Swift of the Chicago Bears is scheduled for $7.5 million in non-guaranteed compensation in 2026, potentially making him a trade or release candidate. Michael Jones of the Minnesota Vikings has a $2 million guarantee for his $9 million base salary in 2026 and could be released for a committee role on a team with better playoff odds."
    }
  ],
  "nba": [
    {
      "title": "NBA All-Star Weekend and Format Changes",
      "analysis": "The 2026 NBA All-Star Game will take place on February 15, 2026, at the Intuit Dome in Inglewood, California, marking the venue\u0027s first time hosting the event. All-Star Weekend will run from February 13-15 and include events like the Rising Stars game and the Celebrity Game. This year\u0027s All-Star Game will feature a new USA vs. The World format, where two U.S. teams and one World team compete in a round-robin tournament. The top two teams will then compete in the All-Star Championship game. Each game will be one standard NBA quarter, or 12 minutes long."
    },
    {
      "title": "Potential Star Player Trades in the 2026 Offseason",
      "analysis": "Several NBA superstars are rumored to be potential trade candidates in the 2026 offseason. Giannis Antetokounmpo is considered the most likely star to move, with teams like the Heat, Warriors, Knicks, and Timberwolves showing interest. Ja Morant, Domantas Sabonis, Draymond Green, Karl-Anthony Towns, and Zion Williamson are also among the top potential trade targets. The Clippers traded James Harden to the Cavaliers for Darius Garland and a second-round pick. They also moved Ivica Zubac to the Pacers for Bennedict Mathurin, Isaiah Jackson, and multiple picks."
    }
  ],
  "nhl": [
    {
      "title": "NHL Outdoor Games and Olympic Participation in 2026",
      "analysis": "The NHL\u0027s 2026 calendar year will start with an outdoor game in Miami on January 2 between the Florida Panthers and New York Rangers, marking the first outdoor NHL game ever held in Florida. A second outdoor game, the 2026 Navy Federal Credit Union NHL Stadium Series, will be played in Tampa on February 1. NHL players will participate in the Olympic Winter Games Milano Cortina 2026, with the men\u0027s tournament running from February 11-22. This marks the first time since 2014 that NHL players have participated in the Winter Games."
    },
    {
      "title": "Oilers\u0027 Offseason Strategy and Potential Trades",
      "analysis": "The Edmonton Oilers\u0027 upcoming offseason is crucial, especially with Connor McDavid potentially entering his final contract year. The team may have approximately $13 million in projected cap space for the 2026-27 season, potentially increasing to $16.6 million if Andrew Mangiapane is not retained. The Oilers acquired Tristan Jarry from the Pittsburgh Penguins for Stuart Skinner, Brett Kulak, and a 2029 second-round pick. A potential trade involving Owen Power from the Buffalo Sabres could bring in a high-end forward."
    }
  ],
  "mlb": [
    {
      "title": "MLB Offseason Spending and Key Player Movements",
      "analysis": "The 2026 MLB offseason has been marked by significant spending, particularly by teams like the Los Angeles Dodgers. The Dodgers acquired Kyle Tucker on a four-year, $240 million deal. The Chicago Cubs signed Alex Bregman to a five-year, $175 million contract. The Baltimore Orioles acquired Pete Alonso on a five-year, $155 million contract and Ryan Helsley for two years and $28 million. The New York Mets traded for Freddy Peralta and signed Marcus Semien and Bo Bichette. Tarik Skubal remains with the Detroit Tigers."
    },
    {
      "title": "Dodgers\u0027 Championship Aspirations and World Baseball Classic",
      "analysis": "The Los Angeles Dodgers are favored to win the World Series in 2026, with odds shifting from \u002B350 to \u002B230 after acquiring Kyle Tucker. The World Baseball Classic (WBC) will take place in 2026, featuring 20 national teams. Shohei Ohtani is expected to return for Team Japan. The 96th All-Star Game is scheduled for July 14 at Citizens Bank Park in Philadelphia. The regular season will begin on March 25 with the San Francisco Giants hosting the New York Yankees."
    }
  ]
}